---
kind: enumMember
id: F:Autodesk.Revit.DB.ModelUpdatesStatus.NotYetInCentral
enum: Autodesk.Revit.DB.ModelUpdatesStatus
source: html/2fc35e00-cdf2-8368-e6a6-032725492cbe.htm
---
# Autodesk.Revit.DB.ModelUpdatesStatus.NotYetInCentral

The element is new in the current model and has not been saved to the central model. Note that this
 status will apply to newly created elements even if they are created in the central model.